<a href="https://colab.research.google.com/github/Claudia-github1/curso_python2/blob/main/sesion66.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
data = [1979, 1980, 1981, 1982] #[] Es una lista
serie = pd.Series(data)
serie

0    1979
1    1980
2    1981
3    1982
dtype: int64

In [4]:
# []Es una lista, representa la data
# Indice aleatorio 
serie = pd.Series([1979, 1980, 1981, 1982])
serie

0    1979
1    1980
2    1981
3    1982
dtype: int64

In [5]:
# Indice definido 
serie = pd.Series(data=[1979, 1980, 1981, 1982, 1983],
                  index=['carolina', 'martha', 'nicky', 'theresa', 'nicky'])
serie

carolina    1979
martha      1980
nicky       1981
theresa     1982
nicky       1983
dtype: int64

In [18]:
#Tratamiento de datos
print(serie['carolina'])
print(serie[0])
print(serie[-3:-1]) # Es un posicionamiento
print(serie[3])
print(serie['nicky'])

1979
1979
nicky      1981
theresa    1982
dtype: int64
1982
nicky    1981
nicky    1983
dtype: int64

In [33]:
serie
serie_nicky = serie['nicky']
serie_nicky

serie_nicky.to_csv('serie_nicky.csv')

In [7]:
#Manipular los datos de las series 
serie_pokemon = pd.read_csv('pokemon.csv', squeeze=True, usecols=['Name'])
serie_pokemon

0           Bulbasaur
1             Ivysaur
2            Venusaur
3       Mega Venusaur
4          Charmander
            ...
795           Diancie
796      Mega Diancie
797    Hoopa Confined
798     Hoopa Unbound
799         Volcanion
Name: Name, Length: 800, dtype: object

In [14]:
serie_pokemon[1:5]

1          Ivysaur
2         Venusaur
3    Mega Venusaur
4       Charmander
Name: Name, dtype: object

In [20]:
serie_pokemon.sort_values(ascending=False)

794    Zygarde Half Forme
695              Zweilous
46                  Zubat
631                 Zorua
632               Zoroark
              ...
678              Accelgor
392                 Absol
68                   Abra
510             Abomasnow
62                    NaN
Name: Name, Length: 800, dtype: object

In [21]:
serie_pokemon.value_counts()

Muk                   1
Golem                 1
Heatmor               1
Shaymin Land Forme    1
Ponyta                1
                     ..
Manaphy               1
Eevee                 1
Duosion               1
Gardevoir             1
Mantine               1
Name: Name, Length: 799, dtype: int64

In [34]:
df = pd.DataFrame({'nombre': ['Pablo', 'Teresa'],
                   'score': [22.2, 33.3]},
                  index=['id1', 'id2']) # agregar indice
df

     nombre  score
id1   Pablo   22.2
id2  Teresa   33.3

In [37]:
nba = pd.read_csv('nba.csv')
nba.columns

Index(['Player', 'height', 'weight', 'collage', 'born', 'birth_city',
       'birth_state'],
      dtype='object')

In [38]:
nba.head(10)

            Player  height  weight  ...    born     birth_city   birth_state
0  Curly Armstrong   180.0    77.0  ...  1918.0            NaN           NaN
1     Cliff Barker   188.0    83.0  ...  1921.0       Yorktown       Indiana
2    Leo Barnhorst   193.0    86.0  ...  1924.0            NaN           NaN
3       Ed Bartels   196.0    88.0  ...  1925.0            NaN           NaN
4      Ralph Beard   178.0    79.0  ...  1927.0    Hardinsburg      Kentucky
5       Gene Berce   180.0    79.0  ...  1926.0            NaN           NaN
6    Charlie Black   196.0    90.0  ...  1921.0           Arco         Idaho
7      Nelson Bobb   183.0    77.0  ...  1924.0   Philadelphia  Pennsylvania
8  Jake Bornheimer   196.0    90.0  ...  1927.0  New Brunswick    New Jersey
9     Vince Boryla   196.0    95.0  ...  1927.0   East Chicago       Indiana

[10 rows x 7 columns]

In [39]:
type(nba.Player), type(nba['Player']), type(nba[['Player']])

(pandas.core.series.Series,
 pandas.core.series.Series,
 pandas.core.frame.DataFrame)

In [ ]:
#DATAFRAME VS SERIE

In [40]:
df.loc['id2']

nombre    Teresa
score       33.3
Name: id2, dtype: object

In [41]:
df.iloc[1]['score']

33.3

In [46]:
data = pd.read_csv('baseball.csv')
data.shape
data.head(5)

      id     player  year  stint team  lg  ...   so  ibb  hbp   sh   sf  gidp
0  88641  womacto01  2006      2  CHN  NL  ...  4.0  0.0  0.0  3.0  0.0   0.0
1  88643  schilcu01  2006      1  BOS  AL  ...  1.0  0.0  0.0  0.0  0.0   0.0
2  88645  myersmi01  2006      1  NYA  AL  ...  0.0  0.0  0.0  0.0  0.0   0.0
3  88649  helliri01  2006      1  MIL  NL  ...  2.0  0.0  0.0  0.0  0.0   0.0
4  88650  johnsra05  2006      1  NYA  AL  ...  4.0  0.0  0.0  0.0  0.0   0.0

[5 rows x 23 columns]

In [47]:
data.axes

[RangeIndex(start=0, stop=100, step=1),
 Index(['id', 'player', 'year', 'stint', 'team', 'lg', 'g', 'ab', 'r', 'h',
        'X2b', 'X3b', 'hr', 'rbi', 'sb', 'cs', 'bb', 'so', 'ibb', 'hbp', 'sh',
        'sf', 'gidp'],
       dtype='object')]

In [55]:
aframe10 = nba.head(10)
aframe10
aframe10.to_csv('aframe10.csv')

In [45]:
data.head

<bound method NDFrame.head of        id     player  year  stint team  lg  ...    so  ibb  hbp   sh   sf  gidp
0   88641  womacto01  2006      2  CHN  NL  ...   4.0  0.0  0.0  3.0  0.0   0.0
1   88643  schilcu01  2006      1  BOS  AL  ...   1.0  0.0  0.0  0.0  0.0   0.0
2   88645  myersmi01  2006      1  NYA  AL  ...   0.0  0.0  0.0  0.0  0.0   0.0
3   88649  helliri01  2006      1  MIL  NL  ...   2.0  0.0  0.0  0.0  0.0   0.0
4   88650  johnsra05  2006      1  NYA  AL  ...   4.0  0.0  0.0  0.0  0.0   0.0
..    ...        ...   ...    ...  ...  ..  ...   ...  ...  ...  ...  ...   ...
95  89525  benitar01  2007      2  FLO  NL  ...   0.0  0.0  0.0  0.0  0.0   0.0
96  89526  benitar01  2007      1  SFN  NL  ...   0.0  0.0  0.0  0.0  0.0   0.0
97  89530  ausmubr01  2007      1  HOU  NL  ...  74.0  3.0  6.0  4.0  1.0  11.0
98  89533   aloumo01  2007      1  NYN  NL  ...  30.0  5.0  2.0  0.0  3.0  13.0
99  89534  alomasa02  2007      1  NYN  NL  ...   3.0  0.0  0.0  0.0  0.0   0.0

[100 rows x 23 columns]>

In [ ]:
#objeto tiene multiples objetos